{
  "ingestion_date": "2026-01-29",
  "source": "adzuna",
  "jobs": [
    {
      "job_id": "5583490782",
      "title": "Data Engineer",
      "company": "Zemoso Technologies",
      "city": "Hyderabad, Telangana",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Job Title: Data Engineer Experience : 5 Years Location : Chennai/Hyderabad/Mumbai/Pune/Bangalore (Hybrid) Key Responsibilities: ● Python Proficiency: Demonstrate a strong command of Python programming language, actively contributing to the development and maintenance of data engineering solutions. ● Data Engineering Expertise: Set up and maintain efficient data pipelines, ensuring smooth data flow and integration across systems. Experience with SQL and Data Warehouse/ Data Lakes is required. Co…",
      "posted_date": "2026-01-14T09:16:45Z"
    },
    {
      "job_id": "5566765321",
      "title": "Data Engineer",
      "company": "Zemoso Technologies",
      "city": "Bangalore, Karnataka",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Job Title: Data Engineer Experience: 5 Years Location: Chennai/Hyderabad/Mumbai/Pune/Bangalore (Hybrid) Key Responsibilities: ● Python Proficiency: Demonstrate a strong command of Python programming language, actively contributing to the development and maintenance of data engineering solutions. ● Data Engineering Expertise: Set up and maintain efficient data pipelines, ensuring smooth data flow and integration across systems. Experience with SQL and Data Warehouse/ Data Lakes is required. Cont…",
      "posted_date": "2026-01-04T09:31:20Z"
    },
    {
      "job_id": "5573050785",
      "title": "Data Engineer",
      "company": "People Tech Group Inc",
      "city": "Hyderabad, Telangana",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Job Description: Job Title: Data Engineer Experience: 5-10 Years Location: Hyderabad Job Type: Full-Time Job Summary: We are seeking a highly skilled Senior Data Engineer with 5 years of experience in data engineering and migration projects. The ideal candidate will have strong expertise in SQL, Python, data modeling, and building scalable data pipelines. Proficiency with AWS services (Redshift, S3, Glue, EMR, Lambda) is essential. A solid understanding of data security and privacy best practic…",
      "posted_date": "2026-01-08T09:41:43Z"
    },
    {
      "job_id": "5595056926",
      "title": "Data Engineer",
      "company": "Inspire Brands Hyderabad Support Center",
      "city": "Hyderabad, Telangana",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Job Description: We are seeking a skilled and motivated Data Engineering Support Analyst to join our team. As a Data Engineering Support Analyst, you will play a crucial role in ensuring the smooth operation and support of our data engineering. Your primary responsibility will be to provide monitoring, and technical assistance, troubleshoot issues, and maintain the reliability and efficiency of our data systems. Experience Range: 3 - 5 years Skills Required: Python, Snowflake, SQL, ADF, Azure D…",
      "posted_date": "2026-01-22T08:56:05Z"
    },
    {
      "job_id": "5603181250",
      "title": "Data Engineer",
      "company": "EXL",
      "city": "India",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Description: Data Engineer with Palantir Expertise We are seeking a seasoned Data Engineer with 5 years of experience in data engineering , AWS , microservices architecture , and AI/ML frameworks , along with hands-on expertise or certification in Palantir Foundry . The ideal candidate will work on designing scalable data solutions, building robust pipelines, and integrating machine learning models into data workflows. Key Responsibilities: 3-6-years of hands-on experience in data engineering w…",
      "posted_date": "2026-01-28T17:37:43Z"
    },
    {
      "job_id": "5583489722",
      "title": "Data Engineer",
      "company": "LTIMindtree",
      "city": "Pune, Maharashtra",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Dear Candidates, We are hiring for a GCP Data Engineer role with LTIMindtree for a full-time position. Experience: 5 years Notice Period: Immediate to 30 days Location: Pan India Mandatory Skills: Strong experience in Data Engineering Hands-on experience with GCP BigQuery Dataproc Please note, we are strictly looking for candidates with the above GCP data engineering experience . Kindly share profiles only if you meet these requirements . Interested candidates can share their updated CV at Neha…",
      "posted_date": "2026-01-14T09:15:14Z"
    },
    {
      "job_id": "5587351355",
      "title": "Data Engineer",
      "company": "Tata Consultancy Services",
      "city": "India",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Job Title Data Engineer Experience - 5 to 10 years Location - Hyderabad/Pune/Chennai/Kochi Required Qualifications Bachelor’s or Master’s degree in Computer Science, Data Engineering, or related field. 5 years of experience in data engineering with hybrid cloud environments. Strong expertise in SQL Edge, AWS Aurora PostgreSQL, Azure SQL, and data migration tools like AWS DMS. Experience with IoT data pipelines and time-series databases such as InfluxDB and Timestream. Proficiency in data transf…",
      "posted_date": "2026-01-16T09:52:58Z"
    },
    {
      "job_id": "5598700966",
      "title": "Data Engineer",
      "company": "Enterprise Minds, Inc",
      "city": "Hyderabad, Telangana",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Data Engineer Role Summary We are looking for a Data Engineer with 1–3 years of experience to design, build, and maintain data pipelines that support analytics and business reporting. The ideal candidate will have hands-on experience with data processing, SQL, and cloud-based data platforms and be eager to grow in large-scale data engineering and analytics systems. Key Responsibilities Build and maintain ETL / ELT data pipelines from multiple data sources. Develop and optimize SQL queries for d…",
      "posted_date": "2026-01-24T17:33:27Z"
    },
    {
      "job_id": "5597104093",
      "title": "Data Engineer",
      "company": "Prophecy Technologies",
      "city": "Hyderabad, Telangana",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": " We’re Hiring | Data Engineer – Grafana & Azure Databricks   Location: Bangalore / Hyderabad / Noida We are inviting applications for the role of Data Engineer – Grafana & Azure Databricks to join our growing data engineering team.  Key Responsibilities: • Design and build scalable data pipelines using Azure Databricks • Write, optimize, and maintain complex SQL queries for analytics and reporting • Create and manage Grafana dashboards for monitoring data pipelines and system performance • Work…",
      "posted_date": "2026-01-23T17:21:06Z"
    },
    {
      "job_id": "5570920891",
      "title": "Data Engineer",
      "company": "Dot & Key Skincare",
      "city": "Kolkata, West Bengal",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Job Title: Data Engineer Job Description: As a Data Engineer, you will be responsible for designing, implementing, and maintaining data pipelines, as well as developing visualizations and reports to enable data-driven decision-making. The ideal candidate will have expertise in Tableau, SQL, Python, and Power BI, along with a strong background in data engineering principles and practices. Responsibilities: Design, build, and optimize data pipelines to extract, transform, and load (ETL) data from…",
      "posted_date": "2026-01-07T09:27:25Z"
    },
    {
      "job_id": "5570922170",
      "title": "Data Engineer",
      "company": "Mount Talent Consulting Pvt Ltd.",
      "city": "Bangalore, Karnataka",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "We are hiring for our client in engineering and data space for the position of Data Engineers . As a Data Engineer, the candidate will play a crucial role in designing, developing, and maintaining data pipelines, systems, and solutions that empower our clients to make informed business decisions. Role : Data Engineer Experience : 2-3yrs Location : Gurgaon and Bangalore Tech Stack : Data engineer, Python, Pyspark, SQL, Cloud (AWS/Azure/GCP) Job Description Building data-intensive solutions that …",
      "posted_date": "2026-01-07T09:28:59Z"
    },
    {
      "job_id": "5598696549",
      "title": "Data Engineer",
      "company": "Terveys Technology Solutions Pvt Ltd",
      "city": "Trivandrum, Thiruvananthapuram",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Job title : Data Engineer Location : Bangalore - Hybrid Experience : 4 Years Key Responsibilities: Administer and manage Databricks clusters, workspaces, and resources. Monitor platform health, availability, and performance. Develop and maintain data pipelines for ingesting, transforming, and loading data into Databricks. Optimize ETL processes for efficiency and scalability. Collaborate with data scientists and analysts to build and optimize data processing and analytics workflows using Databr…",
      "posted_date": "2026-01-24T17:30:12Z"
    },
    {
      "job_id": "5603182365",
      "title": "Data Engineer",
      "company": "TekValue IT Solutions",
      "city": "Hyderabad, Telangana",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Data Engineer Onsite - Hyderabad, India Long Term Required Skills: 5 years of Data Engineer experience 1 year of Python experience Required any cloud experience",
      "posted_date": "2026-01-28T17:38:52Z"
    },
    {
      "job_id": "5597109149",
      "title": "Data Engineer",
      "company": "Flexton Inc.",
      "city": "Bangalore, Karnataka",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Flexton Inc., established in 2007, headquarter is in San Jose, CA with development centers in India at multiple locations. We are a leading professional services company offering a unique product mix that extends into Technology, Consulting, Digital and Operations. Job Title : Data Engineer Below is the complete job description Data Engineer Bangalore, India Hybrid We are seeking a Data Engineer with hands-on experience in Spark and SparkSQL, strong SQL expertise, and solid batch processing exp…",
      "posted_date": "2026-01-23T17:24:44Z"
    },
    {
      "job_id": "5595008710",
      "title": "Data Engineer",
      "company": "Recro",
      "city": "Bangalore, Karnataka",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Data Engineer |  Bengaluru | 1.5-3 yrs | Immediate joiners Responsibilities : •Understand data needs by interfacing with Data Analysts, Data Scientists, Data Engineers, and Business Partners •Architect, build and launch efficient & reliable new data models and pipelines in partnership with Data Engineering •Design, define, and implement metrics and dimensions to enable analysis and predictive modeling •Become a data expert in your business domain and own data quality •Build tools for auditing, …",
      "posted_date": "2026-01-22T07:21:14Z"
    },
    {
      "job_id": "5603181785",
      "title": "Data Engineer",
      "company": "Sikich India",
      "city": "India",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Sikich India is seeking an experienced Data Engineer to join our Data & AI practice. You will design, build, and optimize end-to-end data solutions using Microsoft’s data platforms, including Microsoft Fabric, Azure Synapse Analytics, Databricks, and Power BI. Your work will involve implementing contemporary data architecture patterns (e.g., medallion, DataMesh, Zone-Based, or Lambda, etc), creating robust data pipelines, and delivering insight-driven analytics to help clients make informed dec…",
      "posted_date": "2026-01-28T17:38:28Z"
    },
    {
      "job_id": "5598704284",
      "title": "Data Engineer",
      "company": "BizAcuity",
      "city": "Hyderabad, Telangana",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Job Title: Data Engineer Location: Hyderabad (Work from Office) Job Type: Full-time Shift Time - 3.00 -12.00 AM IST (Monday to Friday) About BizAcuity BizAcuity is on a mission to help enterprises get most out of their data by providing Business Intelligence and Data Analytics services, product development and consulting services for clients across globe in various domains / verticals. Established in 2011, by a strong leadership team and a team of 200 engineers, we have made a mark as a world c…",
      "posted_date": "2026-01-24T17:34:30Z"
    },
    {
      "job_id": "5592253370",
      "title": "Data Engineer",
      "company": "Meril",
      "city": "Bangalore, Karnataka",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Data Engineer Location: Bengaluru (Hybrid) We are seeking a skilled Data Engineer to design, build and maintain scalable data infrastructure that supports research, machine learning and advanced analytics initiatives. This role plays a critical part in enabling reliable, high-performance data systems for data-driven decision-making. The ideal candidate will have a strong foundation in data engineering, experience working with large datasets and the ability to collaborate effectively with multid…",
      "posted_date": "2026-01-20T16:25:26Z"
    },
    {
      "job_id": "5525209056",
      "title": "Data Engineer",
      "company": "SII Group USA",
      "city": "Noida, Ghaziabad",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Job Description: Data Engineering Specialist (PySpark / Databricks) – Noida, India Company: SII Group Location: Noida, India Employment Type: Full-time Role Type: Data Engineer / Senior Data Engineer (depending on experience) About SII Group USA SII Group USA is part of the global SII Group, a leading provider of engineering, consulting, and digital transformation services. Our teams partner with global enterprises to design, build, and scale high-performance technology solutions. We are expand…",
      "posted_date": "2025-12-03T09:02:32Z"
    },
    {
      "job_id": "5573042458",
      "title": "Data Engineer",
      "company": "Mastech Digital",
      "city": "Chennai, Tamil Nadu",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Locations: Chennai and Bengaluru Data Engineer – Microsoft Fabric MassTech Digital | Growth Bench Position We are looking for a Data Engineer with strong Microsoft Fabric and Purview expertise. You will build scalable data pipelines, implement Lakehouse architectures on OneLake, and establish data governance for enterprise clients. Technical Skills Required (6-8 of the following): Fabric Lakehouse and OneLake for unified data storage Data Factory pipelines and Dataflows Gen2 for ingestion Fabri…",
      "posted_date": "2026-01-08T09:35:05Z"
    },
    {
      "job_id": "5570921928",
      "title": "Data Engineer",
      "company": "iAgami",
      "city": "India",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Job Title: Data Engineer – Manufacturing Experience: 5 Years Location: Remote (India) Key Skills: AWS Glue, EMR, Medallion Architecture, ERP Tools (Oracle ERP, SAP ERP, JD Edwards) Job Description: We are seeking a Manufacturing Domain Data Engineer with hands-on experience in building scalable data pipelines on AWS. The role focuses on implementing Medallion Architecture and integrating manufacturing data from Oracle ERP, SAP ERP, or JD Edwards to deliver analytics-ready datasets. Responsibili…",
      "posted_date": "2026-01-07T09:28:53Z"
    },
    {
      "job_id": "5573042475",
      "title": "Data Engineer",
      "company": "Concentrix",
      "city": "Bangalore, Karnataka",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Position : Data Engineer Location: India- Bangalore ( WFO) Objective: The objectives of Data Engineer typically revolve around designing, implementing, and managing robust data architectures and infrastructures. The Data Engineer will play a key role in driving the organization's data strategy, ensuring the efficient flow and storage of data, and supporting data-driven decision-making processes. Duties and Responsibilities: 1. Data Model Design: · Develop and maintain a scalable and efficient d…",
      "posted_date": "2026-01-08T09:35:07Z"
    },
    {
      "job_id": "5587343833",
      "title": "Data Engineer",
      "company": "Amgen India",
      "city": "Hyderabad, Telangana",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Years of experience - 9-15 Experience building enterprise scale data lake, data fabric solutions on cloud leveraging modern approaches like Data Mesh Demonstrated proficiency in leveraging cloud platforms (AWS, Azure, GCP) for data engineering solutions. Strong understanding of cloud architecture principles and cost optimization strategies. Hands-on experience using Databricks, Snowflake, PySpark, Python, SQL Proven ability to lead and develop high-performing data engineering teams. Strong prob…",
      "posted_date": "2026-01-16T09:46:15Z"
    },
    {
      "job_id": "5595006124",
      "title": "Data Engineering",
      "company": "Tata Consultancy Services",
      "city": "Kolkata, West Bengal",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Greetings from TCS TCS is hiring for Data Engineer Experience : 5 to 10 years Location: Kolkata Mode of Drive: Walk-In Date:31st January 2026 (Saturday) Desired Competencies (Technical/Behavioral Competency) Must-Have : Strong experience in programming languages such as Python, PySpark, or Scala for data engineering tasks. Design, develop, and maintain scalable and robust data pipelines on Databricks Hands-on experience with cloud technologies, expertise in AWS/Azure data engineering services t…",
      "posted_date": "2026-01-22T07:18:44Z"
    },
    {
      "job_id": "5593632356",
      "title": "Data Engineer",
      "company": "Talink",
      "city": "Chandigarh, India",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": " We’re Hiring! Data Engineer – Securiti Platform Specialist  Location: Chandigarh, India (preferred) or Remote (India)  Employment Type: Full-time, Permanent  Company: Talink Talink is a rapidly growing global Technology Services company delivering cutting-edge solutions, consulting, and support to clients across multiple industries. Guided by our core values— passion, collaboration, integrity, and innovation —we are committed to empowering businesses with transformative technology. We operate …",
      "posted_date": "2026-01-21T11:20:50Z"
    },
    {
      "job_id": "5595007869",
      "title": "Data Engineer",
      "company": "Accion Labs",
      "city": "Bangalore, Karnataka",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Job Title: Data Engineer – Azure ADF Location: Brookfield, Bangalore Work Mode: Work from Office Experience: 5–6 Years Joining: Immediate Joiners Only Job Description Accion Labs is hiring an experienced Data Engineer with strong expertise in Azure Data Factory (ADF) to join our team in Bangalore. Key Responsibilities Design, develop, and maintain data pipelines using Azure Data Factory Integrate data from multiple data sources Develop and optimize complex SQL queries and data models Implement …",
      "posted_date": "2026-01-22T07:20:10Z"
    },
    {
      "job_id": "5597108901",
      "title": "Data Engineer",
      "company": "Stier Solutions Inc",
      "city": "Hyderabad, Telangana",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Job Title: Data Engineer Location: Hyderabad, Telangana Employment Type: Full-time | On-site / Hybrid About the Role We are looking for a skilled and detail-oriented Data Engineer to design, build, and maintain scalable data pipelines and architectures that power analytics, reporting, and machine learning across the organization. You will play a key role in ensuring reliable, high-quality data is accessible to teams for data-driven decision-making. Key Responsibilities Design, develop, and main…",
      "posted_date": "2026-01-23T17:24:36Z"
    },
    {
      "job_id": "5598703983",
      "title": "Data Engineer",
      "company": "Tata Consultancy Services",
      "city": "Kochi, Ernakulam",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "TCS is Hiring for Snowflake Data Engineer (Only Walk-in Interview at Kochi) Experience: 4 - 10 Years Location: Kochi Role: Snowflake Data Engineer Skill: AWS/Azure/GCP, Snowflake, PL/SQL Interview Mode: Walk in Drive! - Date: 31-Jan-26 (Saturday) Time: 9:30 AM - 1:00 PM Address: TCS - Kochi T ata Consultancy Services, TCS Centre Infopark Road Infopark Campus, Infopark E, Kakkanad, Kerala 682042 On- Venue SPOC: Frittin Jose/ Shinu Jose",
      "posted_date": "2026-01-24T17:34:22Z"
    },
    {
      "job_id": "5583490727",
      "title": "Data Engineer",
      "company": "mCaffeine",
      "city": "Mumbai, Maharashtra",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Company overview: PEP is a dynamic personal care company that proudly houses two innovative brands – mCaffeine & Hyphen . With a passion for creating high-performance, conscious, and consumer-loved products, we are redefining the way personal care is experienced. While mCaffeine is India’s first caffeinated personal care brand, loved for its energizing and playful approach, Hyphen is built on the philosophy of simplifying skincare through science-backed formulations. Together, our brands reflec…",
      "posted_date": "2026-01-14T09:16:43Z"
    },
    {
      "job_id": "5546314986",
      "title": "Data Engineer",
      "company": "Vivriti Capital",
      "city": "Bangalore, Karnataka",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "About Vivriti Group Vivriti Group is a trailblazer in the mid-market lending space, offering customized debt solutions to mid-sized enterprises. The group operates through two core businesses: Vivriti Capital Limited: A systematically important Non-Banking Financial Company (NBFC ND-SI) regulated by the Reserve Bank of India (RBI). Vivriti Capital has disbursed over USD 3 billion to 300 enterprise borrowers and holds a CRISIL rating of A. Vivriti Asset Management: A fixed-income fund manager, m…",
      "posted_date": "2025-12-18T02:38:16Z"
    },
    {
      "job_id": "5582264846",
      "title": "Data Engineer",
      "company": "Insight Global",
      "city": "India",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "SQL Data Engineer Duration : ongoing contract Type of Work : You’ll be a full-time employee with all statutory benefits like Provident Fund, gratuity, paid leave, and job security. Location : 100% remote Pay : 10-15 LPA A Fortune 100 retail client of Insight Global is looking to hire elite Data Engineers to join their Enterprise Data & Analytics Team. This team is responsible for supporting and providing all 12 company business units with the data they need to optimize their BUs and increase ef…",
      "posted_date": "2026-01-13T19:05:52Z"
    },
    {
      "job_id": "5573042650",
      "title": "Data Engineer",
      "company": "Firstsource",
      "city": "Hyderabad, Telangana",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "About Firstsource Firstsource Solutions Limited, an RP-Sanjiv Goenka Group company (NSE: FSL, BSE: 532809, Reuters: FISO.BO, Bloomberg: FSOL:IN), is a specialized global business process services partner, providing transformational solutions and services spanning the customer lifecycle across Healthcare, Banking and Financial Services, Communications, Media and Technology, Retail, and other diverse industries. With an established presence in the US, the UK, India, Mexico, Australia, South Afric…",
      "posted_date": "2026-01-08T09:35:14Z"
    },
    {
      "job_id": "5597110761",
      "title": "Data Engineer",
      "company": "UNIVO Education",
      "city": "Noida, Ghaziabad",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "About the Role We are seeking an experienced Data Engineer to design, build, and optimize scalable data architectures and pipelines that power business insights across our EdTech platform. The ideal candidate will bring strong expertise in data engineering, cloud data platforms, BI tools , and data governance , along with the ability to work cross-functionally to support data-driven decision-making. Key Responsibilities Design and implement robust, scalable, and secure data architectures to sup…",
      "posted_date": "2026-01-23T17:27:17Z"
    },
    {
      "job_id": "5593633659",
      "title": "Data Engineer",
      "company": "POWER COZMO",
      "city": "India",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Title: Big Data Engineer (2 Positions) Company: Powercozmo Industry: B2B eCommerce Platform Experience: 3 Years Employment Type: Full-time THE JOB LOCATION INITIALLY WILL BE IN AMMAN, JORDAN. THE JOB REQUIRES VALID PASSPORT HOLDERS WHO CAN TRAVEL IMMEDIATELY (within 2-3 days) AND WORK ON-SITE. About Power Cozmo Power Cozmo is a growing B2B eCommerce platform focused on building scalable, data driven solutions for enterprises. Our platform relies heavily on modern cloud and big data technologies…",
      "posted_date": "2026-01-21T11:22:12Z"
    },
    {
      "job_id": "5587352922",
      "title": "Data Engineer",
      "company": "Vriba Solutions",
      "city": "India",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Role: Data Engineering Remote Looking for 5-10 years of Exp Skill Set: AWS, Snowflake, Kafka, Airflow, GitHub, PySpark, Python Key Responsibilities: Design, develop, and maintain scalable ETL/ELT pipelines Ingest data from various sources (APIs, databases, files, etc.) Implement both real-time and batch processing solutions based on use case requirements Ensure data quality through validation and cleansing processes Collaborate with Product Managers and Business Stakeholders to gather and under…",
      "posted_date": "2026-01-16T09:53:34Z"
    },
    {
      "job_id": "5486489974",
      "title": "Data Engineer",
      "company": "IntraEdge",
      "city": "India",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "We are seeking a highly skilled Data Engineer with strong experience in Python, PySpark, Snowflake, and AWS Glue to join our growing data team. You will be responsible for building scalable and reliable data pipelines that drive business insights and operational efficiency. This role requires a deep understanding of data modeling, ETL frameworks, and cloud-based data platforms. Job Title: Data Engineer Location: Remote Full-Time Responsibilities: Design, develop, and maintain scalable ETL/ELT p…",
      "posted_date": "2025-11-08T09:59:01Z"
    },
    {
      "job_id": "5581641828",
      "title": "Data Engineer",
      "company": "Ascendion",
      "city": "Bangalore, Karnataka",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Location: Bengaluru, Chennai, Hyderabad and Pune (Hybrid Work model) Job Summary: We are looking for a talented GCP BigQuery Developer with strong SQL skills and basic proficiency in Python to join our data engineering team. The ideal candidate should have hands-on experience working with Google Cloud Platform (GCP) services, particularly BigQuery , and be capable of writing efficient SQL queries to support data transformation, analytics, and reporting tasks. Key Responsibilities: Design and im…",
      "posted_date": "2026-01-13T09:00:42Z"
    },
    {
      "job_id": "5598701284",
      "title": "Data Engineer",
      "company": "MyData Insights",
      "city": "India",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Job Title: AWS Data Engineer Experience: 6 Years Positions: multiple Engagement Type: Contract Location: Remote Role Overview We are looking for two highly skilled Data Engineers to join our team on a contract basis. The ideal candidates will have strong experience in designing, building, and maintaining scalable data pipelines and working with modern cloud-based data platforms. This role requires hands-on expertise in AWS, Apache Airflow, Snowflake, and GitHub. Key Responsibilities Design, dev…",
      "posted_date": "2026-01-24T17:33:38Z"
    },
    {
      "job_id": "5593470468",
      "title": "Data Engineer",
      "company": "SID Global Solutions",
      "city": "Hyderabad, Telangana",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Job Title: Data Engineer Location: Somajiguda, Hyderabad Work Mode: Onsite Shift Timings: 3:00 PM – 12:00 AM IST Job Summary We are seeking an experienced Senior Data Engineer to design, build, and maintain scalable data infrastructure and pipelines. This role requires close collaboration with data scientists, developers, and business stakeholders to ensure high data availability, quality, and reliability across the organization. Key Responsibilities Design, develop, and maintain scalable data …",
      "posted_date": "2026-01-21T08:44:11Z"
    },
    {
      "job_id": "5561949117",
      "title": "Data Engineer",
      "company": "Logic Pursuits",
      "city": "India",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Job Title: Data Engineer (Snowflake  dbt/Matillion) Location: Ahmedabad, India Job Type: Full-time Job Description: We are looking for an experienced and results-driven Data Engineer to join our growing Data Engineering team. The ideal candidate will be proficient in building scalable, high-performance data transformation pipelines using Snowflake and dbt, and able to effectively work in a consulting setup. In this role, you will be instrumental in ingesting, transforming, and delivering high-q…",
      "posted_date": "2026-01-01T08:41:48Z"
    },
    {
      "job_id": "5601191651",
      "title": "Data Engineer",
      "company": "Agile Technology Solutions - Your Technology Partner",
      "city": "Pune, Maharashtra",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Hello Candidate, We are hiring for Well-Known German Product based MNC Position : Azure Data Engineer Exp : 6 to 8 Years Location : Pune Notice Period : Serving Candidates / Preferred Immediate Joiner Job type : Fulltime - Direct payroll with company Skills Required: Data Engineer JD Responsibilities Design and implement scalable data solutions on Microsoft Azure. Develop and manage ETL processes to handle data transformation and loading. Optimize and troubleshoot data pipelines for performance…",
      "posted_date": "2026-01-27T01:23:28Z"
    },
    {
      "job_id": "5590140011",
      "title": "Data Engineer",
      "company": "SANAARI SOFTWARE SOLUTIONS PRIVATE LIMITED",
      "city": "Bangalore, Karnataka",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Priority Hiring: Junior Data Engineer C2H | Remote | US Shift | Immediate Joiners We are urgently looking for Junior Data Engineer who can join immediately . This is a priority role — candidates must be ready to join from this coming Monday . Send CV to: apply@sanaari.net WhatsApp: 91 8008814567 Position Details Role: Junior Data Engineer Experience: 5–8 Years Contract Duration: 12 Months (C2H) Location: Remote Shift: US Shift (Rotational) – 6:30 PM to 3:30 AM IST Notice Period: Immediate joine…",
      "posted_date": "2026-01-18T10:47:40Z"
    },
    {
      "job_id": "5575163311",
      "title": "Data Engineer",
      "company": "Tata Consultancy Services",
      "city": "Chennai, Tamil Nadu",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Role: Data Engineer - Databricks Required Technical Skill Set: AWS/Azure, Databricks, Spark/ PySpark, SQL Desired Experience Range: 6 Years Location of Requirement: Bangalore / Chennai Desired Competencies (Technical/Behavioral Competency) Must-Have ( Ideally should not be more than 3-5) Strong experience in programming languages such as Python, PySpark, or Scala for data engineering tasks. Design, develop, and maintain scalable and robust data pipelines on Databricks Hands-on experience with c…",
      "posted_date": "2026-01-09T08:17:30Z"
    },
    {
      "job_id": "5595005660",
      "title": "Data Engineer",
      "company": "Insight Global",
      "city": "India",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "100% Remote Yearlong contract with extensions Large Fortune 500 company We are seeking a Data Engineer with AI expertise to design and maintain scalable data pipelines while integrating advanced language model applications. The role requires proficiency in Python, PySpark, and web frameworks like FastAPI. You will be responsible for leveraging vector stores and retrievers to enable real-time document processing and querying, while deploying robust, scalable solutions on AWS to solve complex bus…",
      "posted_date": "2026-01-22T07:18:40Z"
    },
    {
      "job_id": "5597108345",
      "title": "Data Engineer",
      "company": "Tata Consultancy Services",
      "city": "Pune, Maharashtra",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Dear Candidate, Greetings from TCS  TCS is hiring for Data Engineer, please find the below JD Experience range – 5 - 10 yrs Location - Hyderabad/Pune/Chennai/Kochi Skills Required - \"Data Engineer, SQL/PostgreSQL /Azure SQL/AWS Aurora, DMS/data migration/data sync, IoT/time series/InfluxDB/Timestream) Role& Responsibilities – Design and implement data migration and synchronization solutions , including AWS DMS setup, bulk migration approaches, and continuous sync mechanisms across SQL Edge, AWS…",
      "posted_date": "2026-01-23T17:22:40Z"
    },
    {
      "job_id": "5583490641",
      "title": "Data Engineer",
      "company": "KnowledgeTrek Consulting",
      "city": "Bangalore, Karnataka",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Company Description Continental develops pioneering technologies and services for sustainable and connected mobility of people and their goods. Founded in 1871, the technology company offers safe, efficient, intelligent, and affordable solutions for vehicles, machines, traffic and transportation. In 2023, Continental generated sales of €41.4 billion and currently employs around 200,000 people in 56 countries and markets. Guided by the vision of being the customer's first choice for material-dri…",
      "posted_date": "2026-01-14T09:16:39Z"
    },
    {
      "job_id": "5538938862",
      "title": "Data Engineer",
      "company": "Stolt-Nielsen Digital Innovation Centre",
      "city": "Hyderabad, Telangana",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "About the Role: Were looking for a Data Engineer with strong Databricks, Python, and SQL skills to build and optimize the data infrastructure that powers our analytics and AI initiatives. In this role, youll design and maintain reliable data pipelines, ensure data quality and performance, and enable data-driven decision-making across the organization. We believe that Data Engineers become only more relevant in the age of Generative AI, as we are transitioning to using solutions like Databricks …",
      "posted_date": "2025-12-12T08:53:28Z"
    },
    {
      "job_id": "5603182753",
      "title": "Data Engineer",
      "company": "Genpact",
      "city": "Hyderabad, Telangana",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Ready to shape the future of work? At Genpact, we don’t just adapt to change—we drive it. AI and digital innovation are redefining industries, and we’re leading the charge. Genpact’s AI Gigafactory , our industry-first accelerator, is an example of how we’re scaling advanced technology solutions to help global enterprises work smarter, grow faster, and transform at scale. From large-scale models to agentic AI , our breakthrough solutions tackle companies’ most complex challenges. If you thrive …",
      "posted_date": "2026-01-28T17:39:17Z"
    },
    {
      "job_id": "5529809598",
      "title": "Data Engineer",
      "company": "Synechron",
      "city": "Bangalore, Karnataka",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "Good-day, We have opprotunity for Data Engineer. Job Role: Data Engineer Job Location: Synechron ( Bengaluru) Experience- 7 to 12 years Notice : Immediate joiner . About Company: At Synechron, we believe in the power of digital to transform businesses for the better. Our global consulting firm combines creativity and innovative technology to deliver industry-leading digital solutions. Synechron’s progressive technologies and optimization strategies span end-to-end Artificial Intelligence, Consu…",
      "posted_date": "2025-12-06T01:30:34Z"
    },
    {
      "job_id": "5491505058",
      "title": "Data Engineer",
      "company": "GMG",
      "city": "India",
      "country": "IN",
      "salary_min": null,
      "salary_max": null,
      "salary_predicted": "0",
      "description": "What we do: GMG is a global well-being company retailing, distributing and manufacturing a portfolio of leading international and home-grown brands across sport, food and health sectors. Its vision is to inspire people to win in ways that make the world better. Today, GMG’s investments span four key verticals: GMG Sports, GMG Food, GMG Health, and GMG Consumer Goods. Under the ownership and management of the Baker family, it has become a leading global company, affiliated with the world’s most …",
      "posted_date": "2025-11-12T10:55:30Z"
    }
  ]
}